<template>
  <div class="box">
    <div class="main-with-header common-bg has-bottom">
      <common-header></common-header>
      <div class="text-1">
        个人征信查询授权书
        重要提示：
        尊敬的客户：
        为了保障您的合法权益，您应当阅读并遵守本授权书。请在签署本授权书前，仔细阅读并充分理解本授权书各条款（特别是黑体字条款），关注您在授权书中的权利和义务。
        除非您已阅读并接受本授权书所有条款，否则您无权使用本金融服务。您的使用、登录等行为即视为您已阅读并同意本授权书条款的约束。
        江苏泗阳农村商业银行股份有限公司：（以下简称“被授权人”或“贵银行”）：
        一、本人同意并不可撤销地授权：贵银行及平台合作方按照国家相关规定采集符合法律法规规定的本人个人信息及包括信贷信息在内的信用信息（包括但不限于本人身份信息、财产信息、交易支付信息、政府或事业单位记录信息、运营商服务使用信息、互联网使用信息、偿债履约能力判断信息、不良信息等），并可以向包括不限于中国人民银行金融信用信息基础数据库、中国互联网金融协会、公安部公民身份信息数据库、其他依法设立的征信机构或信用服务机构、数据服务机构、行业协会等机构（以下统称“第三方机构”）提供以上的本人信息。贵银行及平台合作方可以对本人上述信息进行加工、储存、整理、分析。同时本人同意并不可撤销地授权上述第三方机构对本人相关信息进行收集、查询并提供给贵银行及平台合作方。
        二、本人同意并不可撤销地授权：贵银行及平台合作方可以根据国家有关规定，通过包括不限于中国人民银行金融信用信息基础数据库、中国互联网金融协会、公安部公民身份信息数据库、其他依法设立的征信机构或信用服务机构、数据服务机构、行业协会等机构查询、打印、保存符合法律法规规定地授权人（暨本人）的个人信息（包括但不限于本人基本信息、信用报告、身份信息、财产信息、交易支付信息、政府或事业单位记录信息、运营商服务使用信息、互联网使用信息、偿债履约能力判断信息、不良信息等）。
        用途如下：
        1.审核本人在贵银行申请使用的各类金融产品或服务；
        2.审核本人贷记卡、准贷记卡申请；
        3.审核本人作为担保人；
        4.审核本人作为提出贷款申请或特约商户申请的个人、组织或机构的负责人、法定代表人、出资人、担保人、企业经营者、实际控制人；
        5.审核本人在贵银行VIP客户、特约商户实名审查；
        6.对已向本人或本人担任法人、出资人、担保人、企业经营者、实际控制人的个人、机构或组织发放的贷款、贷记卡（信用卡）、准贷记卡进行贷后风险管理；
        7.依法或经相关部门机构要求；
        8.向本人提供的其他贵行合法经营范围内的业务。
        授权期限：本授权书签发之日起至本人与贵银行的业务终结。
        授权人声明：
        本授权书是本人向贵银行及平台合作方做出的单方承诺，效力具有独立性，不因其他任何协议的任何条款无效而无效。
        贵银行有权根据本人的基本情况、过往征信记录、资产状况等，按照贵银行内部审核标准自主确定是否发放贷款以及发放贷款的额度，有权根据本人的信用情况变动、资产情况变动等，贵银行随时可以调整授信额度；若本人在贵行申请的业务未获批准，本授权书及本人信用报告等资料无须退回本人。
        本授权书内容及相关业务的合同条款不一致的，无论相关合同在本授权书之前或之后签署，均应以本授权书的内容为准，但相关合同条款明确约定是针对本授权内容所做修订的除外。
        以上授权期限为本人做出本授权承诺之日起至本人在被授权人处所有业务终结日止。
        争议解决：若本人与贵银行基于本授权发生任何纠纷或争议，首先应友好协商解决；协商不成的，本人同意将纠纷或争议提交被授权人所在地有管辖权的人民法院管辖。本授权的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
        本人已知悉本授权书所有内容（特别是加粗字体内容）的意义以及由此产生的法律效力，本人确认本授权以数据电文形式在线签署，签署本授权书是本人真实意思表示，本人同意承担由此带来的一切法律后果。
        特此授权！
        特别声明：被受权人已提请本人注意对本授权书印就的条款作全面、准确的理解，并应本人的要求做了相应的条款说明，双方对本授权书的含义认识一致。

        授权人姓名：_______________
        授权人身份证件类型：_______________
        授权人证件号码: _______________
        授权日期：_______________

      </div>
    </div>
    <div class="bottom-fix" v-if="!$route.query.state">
      <div class="bottom-text-1">
        <mu-checkbox v-model="checkbox"></mu-checkbox>
        <div>我已阅读阅读完毕，并充分了解并同意合同章程</div>
      </div>
      <mt-button class="common-parimary-btn1" @click="goNext">签订合同</mt-button>
    </div>
  </div>
</template>
<script>
import {signContract} from '@/api/credit'
export default{
  data () {
    return {
      checkbox: false
    }
  },
  components: {},
  methods: {
    goNext () {
      if (!this.checkbox) {
        this.$toast('请阅读并同意合同章程')
        return
      }
      signContract(this.$route.query.id).then(res => {
        if (res.code === 200) {
          this.$toast(res.message)
          this.$router.push('./project-apply-result')
        }
      })
      // this.$router.push('project-apply')
    }
  }
}
</script>
<style lang='less' scoped>
  @import "./../../public/comment";
  .box{
    height: 100vh;
  }
  .has-bottom{
    padding-bottom: 304px/2;
  }
  .text-1{
    background-color: #fff;
    margin-top: 16px/2;
    padding: 32px/2;
    font-size: 28px/2;
    line-height: 40px/2;
    color: #333333;
  }
  .bottom-fix{
    position: fixed;
    height: 264px/2;
    width: 100%;
    background-color: #fff;
    padding: 32px/2;
    bottom: 0;
    .bottom-text-1{
      display: flex;
      color: rgba(153, 153, 153, 1);
      font-size: 28px/2;
      margin-bottom: 32px/2;
      .book-name{
        color: @lightBlue;
      }
    }
  }
</style>
